#include <stdio.h>

int main() {
    int n,i,j,cnt=0;
    scanf("%d",&n);
    int k = n;

    for(i = 1; i<=n; i++){
        for(j=0;j<cnt;j++)
            printf("  ");
        for(j=0;j<(n-i)*2+1;j++){
            printf("* ");
        }
        printf("\n");
        cnt++;
    }
    

    for(i=cnt-1;i>0;i--){

        for(j=0;j<=k-2;j++){
            printf("  ");
            k--;
            }

        for(j=0;j<(n-i)*2+1;j++){
            printf("* ");
        }
        printf("\n");
    
    }
    return 0;
}
/*
윗삼
별 식
1째줄 =1 + (n-1)*2  O

2째줄 1+ (n-2)*2

띄어쓰기 식
1줄 0
2줄 1
3줄 2
걍 줄-1
-------------------------------------------------------
아랫삼(1개짜리 별은 패스)
(4)
1째줄 --> (n-3)*2+1
2째줄 --> (n-2)*2+1
3째줄 --> (n-1)*2+1

(3)
1째줄 --> (n-2)*2+1
2째줄 --> (n-1)*2+1


줄 수 = cnt-1

4*1 = 3
4*2 = 5
4*3 = 7

2*1=3

3*1=3
3*2=5

*/